%Марчук Л.Б. 5307
%Данная программа решает дифференциальное уравнение
%y' = y/(-1 - exp(x) + y), y(0) = 1 на интервале (0, 5).
%Входной параметр - число разбиений исходного интервала.
%10
%100
%500
%5000

function [] = FRK(numpoints)
    %Задаём уравнение
    f = @(x, y)y/(-1 - exp(x) + y);
    
    %Проходим от 0 до 5 по x с шагом h
    x = 0;
    y = 1;
    
    h = 5/numpoints;
    
    px = x;
    py = y;
    
    while x < 5
        k1 = f(x, y);
        k2 = f(x + h/2, y + k1*h/2);
        k3 = f(x + h/2, y + k2*h/2);
        k4 = f(x + h, y + k3*h);
        
        y = y + h/6*(k1 + 2*k2 + 2*k3 + k4);        
        x = x + h;
        px = [px x];
        py = [py y];
    end;
    
    %Выводим найденное решение
    hold on;
    plot(px, py, 'm');
end