%Марчук Л.Б. 5307
%Данная программа решает дифференциальное уравнение
%y'' + 2y' + y = 1/exp(x), y(1) = 1, y'(1) = 1 на интервале (1, 6).
%Была произведена замена, получена система дифференциальных уравнений
%первого порядка:
%z' = 1/exp(x) - 2z - y,
%y' = z;
%Входной параметр - число разбиений исходного интервала.

function [] = SRK(numpoints)
    %Задаём систему уравнений
    fy = @(x, y, z)1/exp(x) - 2*z - y;
    fz = @(x, y, z)z;
    
    %Проходим от 1 до 6 по x с шагом h
    x = 1;
    y = 1;
    z = 1;
    
    h = 5/numpoints;
    
    px = x;
    py = y;
    pz = z;
    
    while x < 6
        Temp = z;
        
        %Решаем относительно z
        l1 = fz(x, y, z);
        l2 = fz(x + h/2, y, z + l1*h/2);
        l3 = fz(x + h/2, y, z + l2*h/2);
        l4 = fz(x + h, y, z + l3*h);
        z = z + h/6*(l1 + 2*l2 + 2*l3 + l4);
        
        %Решаем относительно y
        k1 = fy(0, 0, Temp);
        k2 = fy(h/2, 0, Temp + k1*h/2);
        k3 = fy(h/2, 0, Temp + k2*h/2);
        k4 = fy(h, 0, Temp + k3*h);
        y = y + h/6*(k1 + 2*k2 + 2*k3 + k4);
        
        x = x + h;
        px = [px x];
        py = [py y];
        pz = [pz z];
    end;
    
    %Выводим найденное решение
    hold on;
    plot(px, py, 'm');
    %plot(px, pz, 'b');
end